# 16. Найдите минимальный элемент из нечетных элементов массива,
# введенных с клавиатуры. Количество элементов вводится первым числом
#
# import random
#
# a = int(input("Введите количество элементов в массиве: "))
# onlyODDNumbers = []
# arr = []
#
# if a > 0 :
#
#     i = 0
#     while i < a :
#         arr.append(random.randint(-100, 100))
#         print(f"{i + 1}. {arr[i]}")
#         i += 1
#
#     for j in range(len(arr)) :
#         if arr[j] % 2 != 0 :
#             onlyODDNumbers.append(arr[j])
#
#     if len(onlyODDNumbers) <= 0 :
#         print("Нечетного числа в массиве нет!")
#         exit(0)
#
#     print(f"Минимальное нечетное число: {min(onlyODDNumbers)}")
#
#
# else :
#     print("Введите положительное число!")



# 16. Задана последовательность N вещественных чисел. Вычислите значение
# выражения √𝑥1·𝑥2·…·𝑥𝑁𝑁.

import math

N = int(input("Введите число N: "))


if N > 0 :

    i = 1
    result = 1
    while i <= N :
        x = int(input(f"Введите число X({i}): "))
        result *= math.sqrt(x * i)
        i += 1

    print(result)



else :
    print("Введите положительное число!")